import { configure } from "vee-validate";
import { localize } from "@vee-validate/i18n";

configure({
  generateMessage: localize("ka", {
    messages: {
      required: "*-ით მონიშნული ველების შევსება სავალდებულოა",
      email: "თქვენ მიერ შეყვანილი მეილი არასწორია",
    },
    fields: {
      first_name: {
        min: "სახელის ველი უნდა შედგებოდეს მინიმუმ 3 სიმბოლოსგან",
        max: "სახელის ველი უნდა შედგებოდეს მაქსიმუმ 255 სიმბოლოსგან",
        alpha: "სახელის ველი უნდა შეიცავდეს მხოლოდ ანბანის ასოებს",
      },
      last_name: {
        min: "გვარის ველი უნდა შედგებოდეს მინიმუმ 3 სიმბოლოსგან",
        max: "გვარის ველი უნდა შედგებოდეს მაქსიმუმ 255 სიმბოლოსგან",
        alpha: "გვარის ველი უნდა შეიცავდეს მხოლოდ ანბანის ასოებს",
      },
    },
  }),
});
